pmo-dataset/variations/graphviz_with_ids/51.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Employee submits a\nvacation request"];
  "Task_2" [label="Requirement is\nregistered"];
  "Task_3" [label="Employee's\nsupervisor receive\nthe request"];
  "Task_4" [label="Supervisor approve\nor reject the\nrequest"];
  "Task_5" [label="Application is\nreturned to employee"];
  "Task_6" [label="Notification is\ngenerated to the HR\nRepresentative"];
  "Task_7" [label="HR Representative\ncomplete the\nrespective\nmanagement\nprocedures"];
  "Task_8" [label="Employee can check\nrejection reasons"];
  "StartNoneEvent_1" [shape=circle, label=""];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label=""];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];

  "StartNoneEvent_1" -> "Task_1";
  "Task_1" -> "Task_2";
  "Task_2" -> "Task_3";
  "Task_3" -> "Task_4";
  "Task_4" -> "ExclusiveGateway_1";
  "Task_6" -> "Task_7";
  "Task_7" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "EndNoneEvent_1";
  "ExclusiveGateway_1" -> "Task_5" [label="rejected"];
  "ExclusiveGateway_1" -> "Task_6" [label="approved"];
  "Task_5" -> "Task_8";
  "Task_8" -> "ExclusiveGateway_2";
}
