pmo-dataset/variations/mermaid_basic/51.mmd
graph LR
	StartEvent_1((" ")) --> Task_1["Employee submits a vacation request"]
	Task_1 --> Task_2["Requirement is registered"]
	Task_2 --> Task_3["Employee's supervisor receive the request"]
	Task_3 --> Task_4["Supervisor approve or reject the request"]
	Task_4 --> ExclusiveGateway_1{"X"}
	Task_6["Notification is generated to the HR Representative"] --> Task_7["HR Representative complete the respective management procedures"]
	Task_7 --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_2 --> EndEvent_1((" "))
	ExclusiveGateway_1 -->|"rejected"| Task_5["Application is returned to employee"]
	ExclusiveGateway_1 -->|"approved"| Task_6
	Task_5 --> Task_8["Employee can check rejection reasons"]
	Task_8 --> ExclusiveGateway_2
